src/Documents/Задание/Задание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задание</name>
  <comment>Аналог документа из ТШК 1С 7.7.</comment>
  <posting>Deny</posting>
  <attributes>
    <name>ВКоробах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКоробках</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНаПеремещение</name>
    <type>
      <types>DocumentRef.ВнПеремОтпуск</types>
    </type>
  </attributes>
  <attributes>
    <name>Зона</name>
    <type>
      <types>CatalogRef.АдресаТЛЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗадания</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаданиеНаОтбор</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комплектовщик</name>
      <type>
        <types>CatalogRef.Комплектовщики</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Модели</types>
      </type>
    </attributes>
    <attributes>
      <name>Модификатор</name>
      <type>
        <types>CatalogRef.моделиКожтовар</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>CatalogRef.моделиРазмер</types>
      </type>
    </attributes>
    <attributes>
      <name>Уценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>CatalogRef.моделиЦвет</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.АдресаТЛЦ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/СтатусЗадания/СтатусЗадания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗадания</name>
  <enumValues>
    <name>Сформировано</name>
    <comment>Задание готово к тому, чтобы комплектовщик взял его в работу.</comment>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Закрыто</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Задание/ObjectModule.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура устанавливает статус задания в значение, соответствующее
// заданию, которое выполняется (из в ТШК 1С 7.7).
Процедура УстановитьСтатусВыполняется() Экспорт

    Статус = Перечисления.СтатусЗадания.Выполняется;
    Записать();

КонецПроцедуры

// Процедура устанавливает статус задания в значение, соответствующее
// выполненному заданию (из в ТШК 1С 7.7).
Процедура УстановитьСтатусЗакрыто() Экспорт

    Статус = Перечисления.СтатусЗадания.Закрыто;
    Записать();

КонецПроцедуры

#КонецОбласти
